ksteensig/platooning/PSoC/00_Basic_Tx.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "CyScBoostClk.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "MISO_aliases.h"
#include "MISO.h"
#include "SS_aliases.h"
#include "SS.h"
#include "IRQ_aliases.h"
#include "IRQ.h"
#include "isr_IRQ.h"
#include "CE_aliases.h"
#include "CE.h"
#include "UART.h"
#include "LED_aliases.h"
#include "LED.h"
#include "nRF24_DEFS.h"
#include "nRF24_FUNCS.h"
#include "nRF24_HAL.h"
#include "nRF24_COMMANDS.h"
#include "nRF24_CONFIG.h"
#include "MOSI_aliases.h"
#include "MOSI.h"
#include "SCLK_aliases.h"
#include "SCLK.h"
#include "SPI.h"
#include "SPI_PVT.h"
#include "ThrottlePin_aliases.h"
#include "ThrottlePin.h"
#include "isr_send.h"
#include "throttleTimer.h"
#include "Clock.h"
#include "isr_throttle_Fall.h"
#include "PWMHBro.h"
#include "HBroClock.h"
#include "N1_aliases.h"
#include "N1.h"
#include "N2_aliases.h"
#include "N2.h"
#include "P1_aliases.h"
#include "P1.h"
#include "P2_aliases.h"
#include "P2.h"
#include "speaker_aliases.h"
#include "speaker.h"
#include "PWMSend.h"
#include "ServoClock.h"
#include "ServoPWM_aliases.h"
#include "ServoPWM.h"
#include "SteeringPin_aliases.h"
#include "SteeringPin.h"
#include "isr_steering_Fall.h"
#include "PWMServo.h"
#include "steeringTimer.h"
#include "UART_IntClock.h"
#include "SPI_IntClock.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

